Тест_ЗУП_31_КОРП/src/Documents/РезультатыСпецоценкиУсловийТруда/РезультатыСпецоценкиУсловийТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатыСпецоценкиУсловийТруда</name>
  <basedOn>Document.ПодготовкаСпецоценкиУсловийТруда</basedOn>
  <registerRecords>InformationRegister.РезультатыСпециальнойОценкиУсловийТруда</registerRecords>
  <registerRecords>InformationRegister.ПлановыеДатыСпециальнойОценкиУсловийТруда</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПодготовкаСпецоценкиУсловийТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезультатов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОхрануТруда</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственногоЗаОхрануТруда</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочиеМеста</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРабочегоМеста</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлассУсловийТруда</name>
      <type>
        <types>EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</types>
      </type>
    </attributes>
    <attributes>
      <name>Рекомендации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АналогичныеМеста</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогичноеМесто</name>
      <type>
        <types>DefinedType.УсловияТруда</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комиссия</name>
    <attributes>
      <name>ЧленКомиссии</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РольВКомиссии</name>
      <type>
        <types>EnumRef.РолиЧленовКомиссииОхраныТруда</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Documents/РезультатыСпецоценкиУсловийТруда/Forms/ФормаАналогичныхМест/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ПредставлениеГруппы") Тогда
		ПредставлениеГруппы = Параметры.ПредставлениеГруппы;
	КонецЕсли;
	
	Если Параметры.Свойство("ОсновноеРабочееМесто") Тогда
		ОсновноеРабочееМесто = Параметры.ОсновноеРабочееМесто;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоПросмотр") И Параметры.ТолькоПросмотр <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаКомандаОК", "Видимость", Не Параметры.ТолькоПросмотр);
	КонецЕсли;
	
	АналогичныеРабочиеМеста.Очистить();
	Для Каждого АналогичноеМесто Из Параметры.АналогичныеМеста Цикл
		Если ПустаяСтрока(ПредставлениеГруппы) И Не ПустаяСтрока(АналогичноеМесто.Представление) Тогда
			ПредставлениеГруппы = АналогичноеМесто.Представление;
		КонецЕсли;
		АналогичныеРабочиеМеста.Добавить(АналогичноеМесто.РабочееМесто, ?(ПустаяСтрока(АналогичноеМесто.Представление), "", АналогичноеМесто.Представление));
	КонецЦикла;
	
	РабочиеМеста.Очистить();
	Для Каждого РабочееМесто Из Параметры.РабочиеМеста Цикл
		Если АналогичныеРабочиеМеста.НайтиПоЗначению(РабочееМесто.РабочееМесто) = Неопределено Тогда
			РабочиеМеста.Добавить(РабочееМесто.РабочееМесто, ?(ПустаяСтрока(РабочееМесто.Представление), "", РабочееМесто.Представление));
		КонецЕсли;
	КонецЦикла;
	
	АналогичныеРабочиеМеста.СортироватьПоПредставлению();
	РабочиеМеста.СортироватьПоПредставлению();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Не ЗначениеЗаполнено(ПредставлениеГруппы) И АналогичныеРабочиеМеста.Количество() > 0 Тогда
		ПредставлениеГруппы = ?(ЗначениеЗаполнено(ОсновноеРабочееМесто), Строка(ОсновноеРабочееМесто), Строка(АналогичныеРабочиеМеста[0].Значение));
	КонецЕсли;
	
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("АналогичныеМеста", АналогичныеРабочиеМеста.ВыгрузитьЗначения());
	ПараметрЗакрытия.Вставить("РабочиеМеста", РабочиеМеста.ВыгрузитьЗначения());
	ПараметрЗакрытия.Вставить("ПредставлениеГруппы", ПредставлениеГруппы);
	ПараметрЗакрытия.Вставить("ОсновноеРабочееМесто", ОсновноеРабочееМесто);
	
	Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВправо(Команда)
	
	Для каждого ВыделеннаяСтрока Из Элементы.РабочиеМеста.ВыделенныеСтроки Цикл
		СтрокаТаблицы = РабочиеМеста.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если СтрокаТаблицы <> Неопределено Тогда 
			АналогичныеРабочиеМеста.Добавить(СтрокаТаблицы.Значение, СтрокаТаблицы.Представление);
			РабочиеМеста.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	АналогичныеРабочиеМеста.СортироватьПоПредставлению();
	РабочиеМеста.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВлево(Команда)
	
	Для каждого ВыделеннаяСтрока Из Элементы.АналогичныеРабочиеМеста.ВыделенныеСтроки Цикл
		СтрокаТаблицы = АналогичныеРабочиеМеста.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если СтрокаТаблицы <> Неопределено Тогда 
			РабочиеМеста.Добавить(СтрокаТаблицы.Значение, СтрокаТаблицы.Представление);
			АналогичныеРабочиеМеста.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	АналогичныеРабочиеМеста.СортироватьПоПредставлению();
	РабочиеМеста.СортироватьПоПредставлению();
	
КонецПроцедуры

#КонецОбласти
